Autodesk.Revit.DB.TranslationUtility.TranslateFile(Autodesk.Revit.DB.Document,System.String,System.String,System.String,System.String,System.Boolean)
Translates a content file.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.TranslationUtility.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.TranslationUtility
This utility is used to translate content files
Since:
2014